test-baby.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-04-09 Thu 15:44 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Baby's First Milestones</title>
<meta name="author" content="Sarah &amp; Mike Johnson" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/baby_theme/css/baby.css"/>
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Quicksand:wght@400;500;600;700&family=Nunito:wght@300;400;500;600;700&family=Fira+Code:wght@300;400;500&display=swap"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">My Baby's First Milestones</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4565284">1. 🍼 Feeding Schedule</a>
<ul>
<li><a href="#orgcb6c58e">1.1. [ ] Morning Feeding</a></li>
<li><a href="#orgf94a100">1.2. [X] Night Feeding</a></li>
</ul>
</li>
<li><a href="#orga3ff05f">2. 📊 Growth Tracker</a></li>
<li><a href="#orga73dccd">3. 🎯 Milestone Goals</a>
<ul>
<li><a href="#org8df822a">3.1. [X] Rolling Over</a></li>
<li><a href="#orga57e140">3.2. [X] Sitting Up</a></li>
<li><a href="#orgbd49d1c">3.3. [ ] Crawling</a></li>
<li><a href="#org8dc070b">3.4. [ ] First Words</a></li>
</ul>
</li>
<li><a href="#orga83a001">4. 🛌 Sleep Patterns</a>
<ul>
<li><a href="#org6259e08">4.1. <span class="todo TODO">TODO</span> Nap Schedule</a></li>
<li><a href="#org43d2178">4.2. DOING Night Sleep</a></li>
<li><a href="#org29cbd33">4.3. NA Sleep Training Methods</a></li>
</ul>
</li>
<li><a href="#org02cb880">5. 🎨 Play &amp; Development</a>
<ul>
<li><a href="#org4a5e39d">5.1. [X] Tummy Time</a></li>
<li><a href="#orgee07f44">5.2. [X] Sensory Play</a></li>
<li><a href="#orge24bf3c">5.3. [ ] Motor Skills</a></li>
</ul>
</li>
<li><a href="#orgc2fa807">6. 🗓️ Upcoming Appointments</a></li>
<li><a href="#org63e97d3">7. 👨‍👩‍👶 Family Activities</a></li>
<li><a href="#org43d2f82">8. 💕 Special Notes</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4565284" class="outline-2">
<h2 id="org4565284"><span class="section-number-2">1.</span> 🍼 Feeding Schedule</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcb6c58e" class="outline-3">
<h3 id="orgcb6c58e"><span class="section-number-3">1.1.</span> [ ] Morning Feeding</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Bottle preparation</li>
<li class="off"><code>[&#xa0;]</code> Temperature check</li>
<li class="off"><code>[&#xa0;]</code> Burping after feeding</li>
<li class="off"><code>[&#xa0;]</code> Clean bottles</li>
</ul>
</div>
</div>
<div id="outline-container-orgf94a100" class="outline-3">
<h3 id="orgf94a100"><span class="section-number-3">1.2.</span> [X] Night Feeding</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li class="on"><code>[X]</code> Last night's record ✓</li>
<li class="on"><code>[X]</code> Sleep duration: 4 hours ✓</li>
<li class="on"><code>[X]</code> Diaper change ✓</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga3ff05f" class="outline-2">
<h2 id="orga3ff05f"><span class="section-number-2">2.</span> 📊 Growth Tracker</h2>
<div class="outline-text-2" id="text-2">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-right">Weight (lbs)</th>
<th scope="col" class="org-right">Height (in)</th>
<th scope="col" class="org-left">Diaper Size</th>
<th scope="col" class="org-left">Mood</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Oct 15</td>
<td class="org-right">7.2</td>
<td class="org-right">19.5</td>
<td class="org-left">Newborn</td>
<td class="org-left">😊</td>
</tr>

<tr>
<td class="org-left">Nov 15</td>
<td class="org-right">8.5</td>
<td class="org-right">21.0</td>
<td class="org-left">Size 1</td>
<td class="org-left">😊</td>
</tr>

<tr>
<td class="org-left">Dec 15</td>
<td class="org-right">9.8</td>
<td class="org-right">22.5</td>
<td class="org-left">Size 1</td>
<td class="org-left">😁</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga73dccd" class="outline-2">
<h2 id="orga73dccd"><span class="section-number-2">3.</span> 🎯 Milestone Goals</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org8df822a" class="outline-3">
<h3 id="org8df822a"><span class="section-number-3">3.1.</span> [X] Rolling Over</h3>
<div class="outline-text-3" id="text-3-1">
<p>
COMPLETED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-11-20 Wed&gt;</span></span>
</p>
<ul class="org-ul">
<li>Front to back ✓</li>
<li>Back to front ✓</li>
<li>Rolls in sleep ✓</li>
</ul>
</div>
</div>
<div id="outline-container-orga57e140" class="outline-3">
<h3 id="orga57e140"><span class="section-number-3">3.2.</span> [X] Sitting Up</h3>
<div class="outline-text-3" id="text-3-2">
<p>
COMPLETED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-12-01 Sun&gt;</span></span>
</p>
<ul class="org-ul">
<li>With support ✓</li>
<li>Without support ✓</li>
<li>For 5+ minutes ✓</li>
</ul>
</div>
</div>
<div id="outline-container-orgbd49d1c" class="outline-3">
<h3 id="orgbd49d1c"><span class="section-number-3">3.3.</span> [ ] Crawling</h3>
<div class="outline-text-3" id="text-3-3">
<p>
PREDICTED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-15 Wed&gt;</span></span>
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Rocking on hands and knees</li>
<li class="off"><code>[&#xa0;]</code> Moving forward</li>
<li class="off"><code>[&#xa0;]</code> Navigation skills</li>
</ul>
</div>
</div>
<div id="outline-container-org8dc070b" class="outline-3">
<h3 id="org8dc070b"><span class="section-number-3">3.4.</span> [ ] First Words</h3>
<div class="outline-text-3" id="text-3-4">
<p>
PREDICTED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-01 Sat&gt;</span></span>
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> "Mama"</li>
<li class="off"><code>[&#xa0;]</code> "Dada"</li>
<li class="off"><code>[&#xa0;]</code> "Hi"</li>
</ul>

<blockquote>
<p>
"Every baby is a miracle that we didn't make, but get to help shape."
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-orga83a001" class="outline-2">
<h2 id="orga83a001"><span class="section-number-2">4.</span> 🛌 Sleep Patterns</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org6259e08" class="outline-3">
<h3 id="org6259e08"><span class="section-number-3">4.1.</span> <span class="todo TODO">TODO</span> Nap Schedule</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Morning nap (9:30am - 11:00am)</li>
<li class="off"><code>[&#xa0;]</code> Afternoon nap (1:30pm - 3:30pm)</li>
<li class="off"><code>[&#xa0;]</code> Early evening wind-down (5:00pm)</li>
</ul>
</div>
</div>
<div id="outline-container-org43d2178" class="outline-3">
<h3 id="org43d2178"><span class="section-number-3">4.2.</span> DOING Night Sleep</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Bedtime routine established</li>
<li class="off"><code>[&#xa0;]</code> Sleep environment optimized</li>
<li class="off"><code>[&#xa0;]</code> White noise machine on</li>
</ul>
</div>
</div>
<div id="outline-container-org29cbd33" class="outline-3">
<h3 id="org29cbd33"><span class="section-number-3">4.3.</span> NA Sleep Training Methods</h3>
<div class="outline-text-3" id="text-4-3">
</div>
</div>
</div>
<div id="outline-container-org02cb880" class="outline-2">
<h2 id="org02cb880"><span class="section-number-2">5.</span> 🎨 Play &amp; Development</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org4a5e39d" class="outline-3">
<h3 id="org4a5e39d"><span class="section-number-3">5.1.</span> [X] Tummy Time</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>10 minutes daily ✓</li>
<li>Head lifting improving ✓</li>
<li>Reaching for toys ✓</li>
</ul>
</div>
</div>
<div id="outline-container-orgee07f44" class="outline-3">
<h3 id="orgee07f44"><span class="section-number-3">5.2.</span> [X] Sensory Play</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Black &amp; white cards</li>
<li>Soft textured toys</li>
<li>Music &amp; singing</li>
</ul>
</div>
</div>
<div id="outline-container-orge24bf3c" class="outline-3">
<h3 id="orge24bf3c"><span class="section-number-3">5.3.</span> [ ] Motor Skills</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Grasping toys</li>
<li class="off"><code>[&#xa0;]</code> Reaching for objects</li>
<li class="off"><code>[&#xa0;]</code> Bringing hands to mouth</li>
</ul>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #d55e00; font-style: italic;">// </span><span style="color: #d55e00; font-style: italic;">Baby's favorite things
</span><span style="color: #f8ec59;">const</span> <span style="color: #00ff00;">babyFavorites</span> = {
  toys: [<span style="color: #ff00ff;">'Rattle'</span>, <span style="color: #ff00ff;">'Soft Book'</span>, <span style="color: #ff00ff;">'Musical Mobile'</span>],
  foods: [<span style="color: #ff00ff;">'Breast milk'</span>, <span style="color: #ff00ff;">'Formula'</span>],
  activities: [<span style="color: #ff00ff;">'Tummy time'</span>, <span style="color: #ff00ff;">'Singing'</span>, <span style="color: #ff00ff;">'Reading'</span>]
};
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc2fa807" class="outline-2">
<h2 id="orgc2fa807"><span class="section-number-2">6.</span> 🗓️ Upcoming Appointments</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>TODO Pediatric Checkup |<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-10 Fri&gt;</span></span></li>
<li>TODO Vaccination Schedule |<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-15 Wed&gt;</span></span></li>
<li>DOING Baby Photography |<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-20 Mon&gt;</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org63e97d3" class="outline-2">
<h2 id="org63e97d3"><span class="section-number-2">7.</span> 👨‍👩‍👶 Family Activities</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li class="on"><code>[X]</code> First family photo</li>
<li class="on"><code>[X]</code> Baby shower planning</li>
<li class="off"><code>[&#xa0;]</code> Nursery decoration</li>
<li class="off"><code>[&#xa0;]</code> Welcome party preparation</li>
</ul>
</div>
</div>
<div id="outline-container-org43d2f82" class="outline-2">
<h2 id="org43d2f82"><span class="section-number-2">8.</span> 💕 Special Notes</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><b><b>First Smile</b></b>: 6 weeks old 😊</li>
<li><b><b>First Laugh</b></b>: 3 months old 😂</li>
<li><b><b>First Word</b></b>: Coming soon! 💬</li>
<li><b><b>Favorite Toy</b></b>: Soft rattle 🎀</li>
<li><b><b>Best Sleep</b></b>: 6 hours straight! 😴</li>
</ul>

<blockquote>
<p>
"The smallest feet leave the biggest footprints on your heart."
</p>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-12-19 Thu 00:00</p>
<p class="author">Author: Sarah &amp; Mike Johnson</p>
<p class="date">Created: 2026-04-09 Thu 15:44</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
